Revit 2027 API
ParameterTypeId.PlumbingFixturesWasteConnection Property
 "Waste Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlumbingFixturesWasteConnection { get; }
Public Shared ReadOnly Property PlumbingFixturesWasteConnection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlumbingFixturesWasteConnection {
	ForgeTypeId^ get ();
}
static member PlumbingFixturesWasteConnection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace